 ### Create a dataframe in pandas using list and series

#### create a data frame using list


list1 = ['I', 'Love', 'Data', 'Science']

#### create dataframe from Dictionary

city_state = {'Delhi': 'Delhi', 'Mumbai': 'Maharashtra', 'Kolkata': 'West Bengal', 'Banglore': 'Karnataka'}

In [8]:
# Write a code here

import pandas as pd
list1 = ['I', 'Love', 'Data', 'Science']
city_state = {'Delhi': 'Delhi', 'Mumbai': 'Maharashtra', 'Kolkata': 'West Bengal', 'Banglore': 'Karnataka'}

In [10]:
df1=pd.DataFrame(list1)
df1

         0
0        I
1     Love
2     Data
3  Science

In [25]:
df2=pd.DataFrame(city_state,index=city_state)
df2

          Delhi       Mumbai      Kolkata   Banglore
Delhi     Delhi  Maharashtra  West Bengal  Karnataka
Mumbai    Delhi  Maharashtra  West Bengal  Karnataka
Kolkata   Delhi  Maharashtra  West Bengal  Karnataka
Banglore  Delhi  Maharashtra  West Bengal  Karnataka